harley-harley/stm32Practice/blank/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32h753xx.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */



// #include "../../Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h7xx.h"

#define GPIODEN        (1U << 3)  // GPIOD is bit 3 on the AHB4 bus
#define GPIOEEN        (1U << 4)  // GPIOE is bit 4 on the AHB4 bus
#define LED_PIN        (1U << 1)

int main(void){

    RCC->AHB4ENR |= GPIODEN;
    RCC->AHB4ENR |= GPIOEEN;

    // Configure GPIOD as ADC (Bits 3:2 = 01)
    GPIOD->MODER |= (1U << 2);
    GPIOD->MODER |= (1U << 3);
    
    // Configure GPIOE as Output (Bits 3:2 = 01)
    GPIOE->MODER |= (1U << 2);
    GPIOE->MODER &= ~(1U << 3);



    // AI GENERATED START
    uint32_t adc_value;
    float voltage;

    /* 1. Enable GPIOA, GPIOD, GPIOE clocks (AHB4) */
    RCC->AHB4ENR |= RCC_AHB4ENR_GPIOAEN;
    RCC->AHB4ENR |= RCC_AHB4ENR_GPIODEN;
    RCC->AHB4ENR |= RCC_AHB4ENR_GPIOEEN;

    /* 2. Configure PA1 as Analog Mode for ADC3 Channel 1 */
    GPIOA->MODER &= ~(0x3UL << (1 * 2));
    GPIOA->MODER |=  (0x3UL << (1 * 2));

    /* 3. Configure PE1 as General Purpose Output for LED */
    GPIOE->MODER &= ~(0x3UL << (1 * 2));
    GPIOE->MODER |=  (0x1UL << (1 * 2));

    /* 4. Enable ADC3 clock (AHB4) - CHANGED from AHB1 ADC12EN */
    RCC->AHB4ENR |= RCC_AHB4ENR_ADC3EN;

    /* 5. Select ADC clock source: HSI (00) since no PLL is configured */
    RCC->D3CCIPR &= ~RCC_D3CCIPR_ADCSEL;

    /* 6. Exit Deep Power-Down and enable internal voltage regulator */
    ADC3->CR &= ~ADC_CR_DEEPPWD;
    ADC3->CR |= ADC_CR_ADVREGEN;

    while (!(ADC3->ISR & ADC_ISR_LDORDY));

    /* 7. Calibration: Single-ended mode */
    ADC3->CR &= ~ADC_CR_ADCALDIF;
    ADC3->CR |= ADC_CR_ADCAL;
    while (ADC3->CR & ADC_CR_ADCAL);

    /* 8. Enable ADC3 */
    ADC3->ISR |= ADC_ISR_ADRDY;
    ADC3->CR |= ADC_CR_ADEN;
    while (!(ADC3->ISR & ADC_ISR_ADRDY));

    /* 9. Explicit 16-bit resolution */
    ADC3->CFGR &= ~ADC_CFGR_RES;

    /* 10. Configure regular sequence: 1 conversion, Rank 1 = Channel 1 (PA1) */
    ADC3->SQR1 &= ~ADC_SQR1_L;
    ADC3->SQR1 &= ~ADC_SQR1_SQ1;
    ADC3->SQR1 |= (1UL << ADC_SQR1_SQ1_Pos);

    /* 11. Set sampling time for channel 1 (SMPR1 covers channels 0-9) */
    ADC3->SMPR1 &= ~(0x7UL << (1 * 3));
    ADC3->SMPR1 |=  (0x4UL << (1 * 3));

    /* 12. Main loop: toggle LED when voltage > 3V */
    while (1)
    {
        ADC3->CR |= ADC_CR_ADSTART;
        while (!(ADC3->ISR & ADC_ISR_EOC));
        adc_value = ADC3->DR;
        voltage = ((float)adc_value / 65535.0f) * 3.3f;

        if (voltage > 3.0f) {
            GPIOE->ODR ^= LED_PIN;  // Toggle PE1
        } else {
            GPIOE->ODR &= ~LED_PIN; // Ensure off when below threshold
        }

        for (volatile int i = 0; i < 500000; i++) { __asm("nop"); }
    }


    // while(1){
    //     // 3. Toggle Pin 8
    //     if(voltage > 3) {
    //       GPIOE->ODR ^= LED_PIN;
    //     }
        
    //     // 4. Wait
    //     for(volatile int i = 0; i < 500000; i++) { __asm("nop"); }
    // }
}



// int main(void)
// {

//   /* USER CODE BEGIN 1 */

//   /* USER CODE END 1 */

//   /* MPU
//   Configuration--------------------------------------------------------*/
//   MPU_Config();

//   /* MCU
//   Configuration--------------------------------------------------------*/

//   /* Reset of all peripherals, Initializes the Flash interface and the
//   Systick. */ HAL_Init();

//   /* USER CODE BEGIN Init */

//   /* USER CODE END Init */

//   /* Configure the system clock */
//   SystemClock_Config();

//   /* USER CODE BEGIN SysInit */

//   /* USER CODE END SysInit */

//   /* Initialize all configured peripherals */
//   MX_GPIO_Init();
//   /* USER CODE BEGIN 2 */

//   /* USER CODE END 2 */

//   /* Infinite loop */
//   /* USER CODE BEGIN WHILE */
//   while (1)
//   {
//     /* USER CODE END WHILE */

//     /* USER CODE BEGIN 3 */
//   }
//   /* USER CODE END 3 */
// }

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Supply configuration update enable
   */
  HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);

  /** Configure the main internal regulator output voltage
   */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE2);

  while (!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {
  }

  /** Initializes the RCC Oscillators according to the specified parameters
   * in the RCC_OscInitTypeDef structure.
   */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
   */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2 |
                                RCC_CLOCKTYPE_D3PCLK1 | RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV1;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK) {
    Error_Handler();
  }
}

/**
 * @brief GPIO Initialization Function
 * @param None
 * @retval None
 */
static void MX_GPIO_Init(void) {
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();

  /*Configure GPIO pins : STLINK_RX_Pin STLINK_TX_Pin */
  GPIO_InitStruct.Pin = STLINK_RX_Pin | STLINK_TX_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF7_USART3;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/* MPU Configuration */

void MPU_Config(void) {
  MPU_Region_InitTypeDef MPU_InitStruct = {0};

  /* Disables the MPU */
  HAL_MPU_Disable();

  /** Initializes and configures the Region and the memory to be protected
   */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.BaseAddress = 0x0;
  MPU_InitStruct.Size = MPU_REGION_SIZE_4GB;
  MPU_InitStruct.SubRegionDisable = 0x87;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.AccessPermission = MPU_REGION_NO_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);
  /* Enables the MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void) {
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1) {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line) {
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line
     number, ex: printf("Wrong parameters value: file %s on line %d\r\n", file,
     line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
